coq/aula10.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2018-05-19 sáb 15:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aula 10 - Funções de ordem superior</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro - rafaelcgs10.github.io/coq" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Aula 10 - Funções de ordem superior</h1>

<div id="outline-container-org4e1d23e" class="outline-2">
<h2 id="org4e1d23e"><span class="section-number-2">1</span> Funções como dados</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6a7e629" class="outline-3">
<h3 id="org6a7e629"><span class="section-number-3">1.1</span> Funções como dados</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Muitas linguagens de programação funcional (como ML, OCaml, Haskell, Scheme, Scala&#x2026;) tratam funções como <i>first-class citizens</i> (ou valores de primeira classe), permitindo que sejam tratados como quaisquer outros valores. Portanto, podem ser passados como argumentos e ser retorno de funçẽos.</li>
<li>Analogamente, em C é possível passar uma função por referência e retornar um endereço de uma função.</li>
<li>Em coq, funções de ordem superior são simples de definir:</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">doit3times</span> {<span style="color: #DFAF8F;">X</span>:<span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">f</span>:X-&gt;X) (<span style="color: #DFAF8F;">n</span>:X) : X :=
  f (f (f n)).

<span style="color: #F0DFAF; font-weight: bold;">Check</span> <span style="color: #BFEBBF;">@</span>doit3times.
<span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">===&gt; doit3times : forall X : Type, (X -&gt; X) -&gt; X -&gt; X </span><span style="color: #5F7F5F;">*)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee7b790" class="outline-3">
<h3 id="orgee7b790"><span class="section-number-3">1.2</span> Funções anônimas</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Funções anônimas estão cada vez mais presentes em linguagens de programação. São geralmente úteis quando queremos fazer uma pequena definição local, sem ter que dar um nome.</li>
<li>Funções anônimas são reclaradas com o termo <i>fun</i>, seguido do seus argumentos, uma seta <i>=&gt;</i> e por fim o corpo da sua definição.</li>
<li>Funções anônimas geralmente são usadas para fornecer um argumento para uma função de ordem superior.</li>
</ul>


<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">test_anon_fun'</span>:
  doit3times (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">n</span> =&gt; n * n) 2 = 256.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>. <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc56582" class="outline-3">
<h3 id="orgcc56582"><span class="section-number-3">1.3</span> A função de ordem superior <i>filter</i></h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>A função <i>filter</i> recebe uma lista (<i>list X</i>) e um predicado sobre <i>X</i> (uma função de <i>X</i> para <i>bool</i>), e retorna uma nova lista contendo somente os elementos os quais o predicado vale <i>true</i>.</li>
<li>A sintaxe do <i>if</i> retorna o termo do <i>then</i> caso a condição seja avaliada para o primeiro valor do seu tipo indutivo, caso seja o segundo então retorna o termo do <i>else</i>. O tipo indutivo precisa ter exatamente dois valores (sem argumentos).</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">filter</span> {<span style="color: #DFAF8F;">X</span>:<span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">test</span>: X-&gt;bool) (<span style="color: #DFAF8F;">l</span>:list X)
                : (list X) :=
  <span style="color: #7CB8BB;">match</span> l <span style="color: #7CB8BB;">with</span>
  | []     =&gt; []
  | h :: t =&gt; <span style="color: #7CB8BB;">if</span> test h <span style="color: #7CB8BB;">then</span> h :: (filter test t)
                        <span style="color: #7CB8BB;">else</span>       filter test t
  <span style="color: #7CB8BB;">end</span>.
<span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">test_filter1</span>: filter evenb [1;2;3;4] = [2;4].
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>. <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org7842ade" class="outline-3">
<h3 id="org7842ade"><span class="section-number-3">1.4</span> A função de ordem superior <i>map</i></h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>A função <i>map</i> é outra função de ordem superior muito comum: recebe uma função <i>f : X -&gt; Y</i> e uma lista <i>l : list X</i> e retorna uma lista <i>list Y</i> a qual <i>f</i> foi aplicada a cada elemento de <i>l</i>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">map</span> {<span style="color: #DFAF8F;">X Y</span>:<span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">f</span>:X-&gt;Y) (<span style="color: #DFAF8F;">l</span>:list X) : (list Y) :=
  <span style="color: #7CB8BB;">match</span> l <span style="color: #7CB8BB;">with</span>
  | []     =&gt; []
  | h :: t =&gt; (f h) :: (map f t)
  <span style="color: #7CB8BB;">end</span>.

<span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">test_map1</span>: map (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">x</span> =&gt; plus 3 x) [2;0;2] = [5;3;5].
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>. <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-orga71ed8b" class="outline-3">
<h3 id="orga71ed8b"><span class="section-number-3">1.5</span> A função de ordem superior <i>fold</i></h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>A função <i>fold</i> é o reduce do modelo de computação map/reduce.</li>
<li>Intuitivamente o comportamento da função <i>fold</i> é inserir um operador binários <i>f</i> entre os elementos de uma lista. Por exemplo, <i>fold plus [1;2;3]</i> significa <i>1 + 2 + 3</i>. Para ser preciso é necessário considerar um elemento inicial <i>b</i>, então <i>fold plus [1;2;3] 0</i> siginifica 1 + 2 + 3 + 0.</li>
<li>Como <i>f</i> é aplicado da direita pra esquerda, então este <i>fold</i> é  um <i>foldr</i>!</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">fold</span> {<span style="color: #DFAF8F;">X Y</span>:<span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">f</span>: X-&gt;Y-&gt;Y) (<span style="color: #DFAF8F;">l</span>:list X) (<span style="color: #DFAF8F;">b</span>:Y)
                         : Y :=
  <span style="color: #7CB8BB;">match</span> l <span style="color: #7CB8BB;">with</span>
  | nil =&gt; b
  | h :: t =&gt; f h (<span style="color: #BFEBBF; background-color: #3F3F3F;">fold</span> f t b)
  <span style="color: #7CB8BB;">end</span>.

<span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">fold_example1</span> :
  <span style="color: #BFEBBF; background-color: #3F3F3F;">fold</span> mult [1;2;3;4] 1 = 24.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>. <span style="color: #BFEBBF;">reflexivity</span>. <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e7cd1b" class="outline-3">
<h3 id="org7e7cd1b"><span class="section-number-3">1.6</span> Funções que retornam funções</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Vimos funções que recebem funções e retornam valores, mas o oposto também é possível!</li>
<li>A função abaixo recebe um valor do tipo <i>X</i> e retorna uma uma função que recebe qualquer número natural e retorna esse valor, ou seja uma função de tipo <i>nat -&gt; X</i>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">constfun</span> {<span style="color: #DFAF8F;">X</span>: <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">x</span>: X) : nat-&gt;X :=
  <span style="color: #7CB8BB;">fun</span> (<span style="color: #DFAF8F;">k</span>:nat) =&gt; x.

<span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">ftrue</span> := constfun true.

<span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">constfun_example1</span> : ftrue 0 = true.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>. <span style="color: #BFEBBF;">reflexivity</span>. <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 23/05/2018</p>
<p class="author">Author: Rafael Castro - rafaelcgs10.github.io/coq</p>
<p class="date">Created: 2018-05-19 sáb 15:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
